tutorials/oneWayCoupledCrysPBEFoam/taylor/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2606
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    innerWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    outerWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }    
    bottom
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    top
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }    
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
