tutorials/oneWayCoupledCrysPBEFoam/taylor/system/decomposeParDict

// * * * * * * * * * //
FoamFile
{
	version 0.5;
	format ascii;
	root "ROOT";
	case "CASE";
	class dictionary;
	object nix;
}
method simple;
numberOfSubdomains 8;

simpleCoeffs
{
    n (2 1 4);
    delta 0.001;
}
